# Aula 1

Comandos básicos para analisar DataFrame

In [4]:
import pandas as pd
import numpy as np

In [3]:
#Criando dataframe
lista = {'nome':['Julia','Anne','Carol','Felipe','Carlos','Guilherme','Thiago'],
         'genero':['f','f','f','m','m','m','m'],
         'Nota 1':[np.nan, 4, 8, 9, 8, 8, 7],
         'Nota 2':[6, 9, np.nan, 7, 7, 7, 7],
         'Nota 3':[5, 7, 7, np.nan, 9, 10, 9]}
data_list = pd.DataFrame(lista, index = ['29384','34211','34172','06874','23243','16341','34713'])
data_list

            nome genero  Nota 1  Nota 2  Nota 3
29384      Julia      f     NaN     6.0     5.0
34211       Anne      f     4.0     9.0     7.0
34172      Carol      f     8.0     NaN     7.0
06874     Felipe      m     9.0     7.0     NaN
23243     Carlos      m     8.0     7.0     9.0
16341  Guilherme      m     8.0     7.0    10.0
34713     Thiago      m     7.0     7.0     9.0

In [5]:
print("Média:", data_list['Nota 1'].mean(),'\n\n')
print("Desvio padrão:", data_list['Nota 1'].std(),'\n\n')

Média: 7.333333333333333


Desvio padrão: 1.7511900715418263

In [7]:
data_list.dtypes

nome       object
genero     object
Nota 1    float64
Nota 2    float64
Nota 3    float64
dtype: object

In [8]:
data_list.columns

Index(['nome', 'genero', 'Nota 1', 'Nota 2', 'Nota 3'], dtype='object')

In [9]:
data_list.index

Index(['29384', '34211', '34172', '06874', '23243', '16341', '34713'], dtype='object')

In [10]:
data_list.describe()

         Nota 1    Nota 2     Nota 3
count  6.000000  6.000000   6.000000
mean   7.333333  7.166667   7.833333
std    1.751190  0.983192   1.834848
min    4.000000  6.000000   5.000000
25%    7.250000  7.000000   7.000000
50%    8.000000  7.000000   8.000000
75%    8.000000  7.000000   9.000000
max    9.000000  9.000000  10.000000

In [11]:
data_list.sort_values(by='nome')

            nome genero  Nota 1  Nota 2  Nota 3
34211       Anne      f     4.0     9.0     7.0
23243     Carlos      m     8.0     7.0     9.0
34172      Carol      f     8.0     NaN     7.0
06874     Felipe      m     9.0     7.0     NaN
16341  Guilherme      m     8.0     7.0    10.0
29384      Julia      f     NaN     6.0     5.0
34713     Thiago      m     7.0     7.0     9.0

In [12]:
data_list.sort_values(by='Nota 1')

            nome genero  Nota 1  Nota 2  Nota 3
34211       Anne      f     4.0     9.0     7.0
34713     Thiago      m     7.0     7.0     9.0
34172      Carol      f     8.0     NaN     7.0
23243     Carlos      m     8.0     7.0     9.0
16341  Guilherme      m     8.0     7.0    10.0
06874     Felipe      m     9.0     7.0     NaN
29384      Julia      f     NaN     6.0     5.0

In [13]:
data_list['genero'].unique()

array(['f', 'm'], dtype=object)

In [14]:
data_list['genero'].value_counts()

m    4
f    3
Name: genero, dtype: int64

In [15]:
data_list['Nota 1'].sum()

44.0

In [18]:
data_list['Nota 2'].min()

6.0

In [19]:
data_list['Nota 3'].max()

10.0

In [21]:
data_list['Nota 2'].mean()

7.166666666666667

In [22]:
data_list['Nota 1'].median()

8.0